# Introduction to Pandas

**pandas** is a Python package providing fast, flexible, and expressive data structures designed to work with *relational* or *labeled* data both. It is a fundamental high-level building block for executing practical, real world data analysis in Python. 

pandas is well suited for:

- Tabular data with heterogeneously-typed columns, as in an SQL table or Excel spreadsheet
- Ordered and unordered (not necessarily fixed-frequency) time series data.
- Arbitrary matrix data (homogeneously typed or heterogeneous) with row and column labels
- Any other form of observational / statistical data sets. The data actually need not be labeled at all to be placed into a pandas data structure


Key features:
    
- Easy handling of **missing data**
- **Size mutability**: columns can be inserted and deleted from DataFrame and higher dimensional objects
- Automatic and explicit **data alignment**: objects can be explicitly aligned to a set of labels, or the data can be aligned automatically
- Powerful, flexible **group by functionality** to perform split-apply-combine operations on data sets
- Intelligent label-based **slicing, fancy indexing, and subsetting** of large data sets
- Intuitive **merging and joining** data sets
- Flexible **reshaping and pivoting** of data sets
- **Hierarchical labeling** of axes
- Robust **IO tools** for loading data from flat files, Excel files, databases, and HDF5
- **Time series functionality**: date range generation and frequency conversion, moving window statistics, moving window linear regressions, date shifting and lagging, etc.

## Installing and Using Pandas

Installation of Pandas on your system requires NumPy to be installed, and if building the library from source, requires the appropriate tools to compile the C and Cython sources on which Pandas is built.
Details on this installation can be found in the [Pandas documentation](http://pandas.pydata.org/).

Once Pandas is installed, you can import it and check the version:

In [1]:
import pandas
pandas.__version__

'1.4.2'

# Introducing Pandas Objects

At the very basic level, Pandas objects can be thought as enhanced versions of NumPy structured arrays in which the rows and columns are identified with labels rather than simple integer indices.
As we will see during the course of this chapter, Pandas provide a host of useful tools, methods, and functionality on top of the basic data structures, but nearly everything that follows will require an understanding of what these structures are.
Thus, before we go any further, let's introduce these three fundamental Pandas data structures: the ``Series``, ``DataFrame``, and ``Index``.

We will start our code sessions with the standard NumPy and Pandas imports:

In [2]:
import numpy as np
import pandas as pd

### Series

A **Series** is a single vector of data (like a NumPy array) with an *index* that labels each element in the vector.

In [3]:
counts = pd.Series([155,255,455,125,225])
counts

0    155
1    255
2    455
3    125
4    225
dtype: int64

If an index is not specified, a default sequence of integers is assigned as the index. A NumPy array comprises the values of the `Series`, while the index is a pandas `Index` object.

In [4]:
counts.values

array([155, 255, 455, 125, 225], dtype=int64)

In [5]:
counts.index

RangeIndex(start=0, stop=5, step=1)

We can assign meaningful labels to the index, if they are available:

In [9]:
bacteria = pd.Series([155, 255, 455, 125, 225],
    index=['Firmicutes', 'Proteobacteria', 'Actinobacteria','Bacteroidetes', 'Lactobacteria'])

bacteria

Firmicutes        155
Proteobacteria    255
Actinobacteria    455
Bacteroidetes     125
Lactobacteria     225
dtype: int64

These labels can be used to refer to the values in the `Series`.

In [11]:
bacteria['Lactobacteria']

225

Notice that the indexing operation preserve the association between the values and the corresponding indices.

We can still use positional indexing if we wish.

In [12]:
bacteria[0]

155

We can give both the array of values and the index meaningful labels themselves:

In [14]:
bacteria.name = 'counts'
bacteria.index.name = 'phylum'
bacteria

phylum
Firmicutes        155
Proteobacteria    255
Actinobacteria    455
Bacteroidetes     125
Lactobacteria     225
Name: counts, dtype: int64

NumPy's math functions and other operations can be applied to Series without losing the data structure.

In [15]:
np.log(bacteria)

phylum
Firmicutes        5.043425
Proteobacteria    5.541264
Actinobacteria    6.120297
Bacteroidetes     4.828314
Lactobacteria     5.416100
Name: counts, dtype: float64

We can also filter according to the values in the `Series`:

In [17]:
bacteria[bacteria>250]

phylum
Proteobacteria    255
Actinobacteria    455
Name: counts, dtype: int64

A `Series` can be thought of as an ordered key-value store. In fact, we can create one from a `dict`:

In [20]:
bacteria_dict = {'Firmicutes':395, 'Proteobacteria':75, 'Actinobacteria':145,'Bacteroidetes':235, 'Lactobacteria':355}
print(bacteria_dict)
pd.Series(bacteria_dict)

{'Firmicutes': 395, 'Proteobacteria': 75, 'Actinobacteria': 145, 'Bacteroidetes': 235, 'Lactobacteria': 355}

Firmicutes        395
Proteobacteria     75
Actinobacteria    145
Bacteroidetes     235
Lactobacteria     355
dtype: int64

### ``Series`` as generalized NumPy array

From what we've seen so far, it may look like the ``Series`` object is basically interchangeable with a one-dimensional NumPy array.
The essential difference is the presence of the index: while the Numpy Array has an *implicitly defined* integer index used to access the values, the Pandas ``Series`` has an *explicitly defined* index associated with the values.

This explicit index definition gives the ``Series`` object additional capabilities.

### Series as specialized dictionary

In this way, you can think of a Pandas ``Series`` a bit like a specialization of  Python dictionary.
A dictionary is a structure that maps arbitrary keys to set of arbitrary values, and ``Series`` is a structure which maps typed keys to a set of typed values.
This typing is important: just as the type-specific compiled code behind a NumPy array makes it more efficient than Python list for certain operations, the type information of a Pandas ``Series`` makes it much more efficient than Python dictionaries for certain operations.

The ``Series``-as-dictionary analogy can be made even more clear by constructing a ``Series`` object directly from Python dictionary:

## DataFrame: bi-dimensional Series with two (or more) indices

A DataFrame represents a tabular, spreadsheet-like data structure containing an ordered collection of columns, each of which can be a different value type (numeric, string, boolean, etc.). 

The DataFrame has both row and column index; it can be thought of as a dict of Series (all sharing the same index).

DataFrame's can be created in different ways. One of them is from dict's.

In [96]:
data = {"States": ["KA","AP","TN","KL","MH"],
       "Year":[2012,2013,2014,2013,2012],
       "Literacy": [1.2,1.5,1.6,1.1,2.1]}
print(data)
data = pd.DataFrame(data)
data

{'States': ['KA', 'AP', 'TN', 'KL', 'MH'], 'Year': [2012, 2013, 2014, 2013, 2012], 'Literacy': [1.2, 1.5, 1.6, 1.1, 2.1]}

  States  Year  Literacy
0     KA  2012       1.2
1     AP  2013       1.5
2     TN  2014       1.6
3     KL  2013       1.1
4     MH  2012       2.1

To change the order of the columns:

In [97]:
df = pd.DataFrame(data, columns=["Year", "Literacy", "States"])
df

   Year  Literacy States
0  2012       1.2     KA
1  2013       1.5     AP
2  2014       1.6     TN
3  2013       1.1     KL
4  2012       2.1     MH

An `index` can be passed (as with Series), and passing column names not existing, will result in missing data.

Assigning values to new columns is easy

In [98]:
df["nonsense"] = mm.Year/mm.Literacy
df

   Year  Literacy States     nonsense
0  2012       1.2     KA  1676.666667
1  2013       1.5     AP  1342.000000
2  2014       1.6     TN  1258.750000
3  2013       1.1     KL  1830.000000
4  2012       2.1     MH   958.095238

In [99]:
df['Serie_aligned']  = pd.Series(range(5), index = [0, 1, 2, 3, 4])
df

   Year  Literacy States     nonsense  Serie_aligned
0  2012       1.2     KA  1676.666667              0
1  2013       1.5     AP  1342.000000              1
2  2014       1.6     TN  1258.750000              2
3  2013       1.1     KL  1830.000000              3
4  2012       2.1     MH   958.095238              4

Passing a dicts where the values are dicts is also possible

In [100]:
df.to_dict()

{'Year': {0: 2012, 1: 2013, 2: 2014, 3: 2013, 4: 2012},
 'Literacy': {0: 1.2, 1: 1.5, 2: 1.6, 3: 1.1, 4: 2.1},
 'States': {0: 'KA', 1: 'AP', 2: 'TN', 3: 'KL', 4: 'MH'},
 'nonsense': {0: 1676.6666666666667,
  1: 1342.0,
  2: 1258.75,
  3: 1829.9999999999998,
  4: 958.0952380952381},
 'Serie_aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

In [101]:
pd.DataFrame(df.to_dict())

   Year  Literacy States     nonsense  Serie_aligned
0  2012       1.2     KA  1676.666667              0
1  2013       1.5     AP  1342.000000              1
2  2014       1.6     TN  1258.750000              2
3  2013       1.1     KL  1830.000000              3
4  2012       2.1     MH   958.095238              4

### DataFrame as specialized dictionary

Similarly, we can also think of a ``DataFrame`` as a specialization of dictionary.
Where a dictionary maps a key to a value, a ``DataFrame`` maps a column name to a ``Series`` of column data.
For example, asking for the ``'area'`` attribute returns the ``Series`` object containing the areas we saw earlier:

#### From a list of dicts

Any list of dictionaries can be made into a ``DataFrame``.
We'll use a simple list comprehension to create some data:

In [93]:
data = [{'a':i, 'b':10*i} for i in range(8)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}, {'a': 6, 'b': 60}, {'a': 7, 'b': 70}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50
6  6  60
7  7  70

Even if some keys in the dictionary are missing, Pandas will fill them in with ``NaN`` (i.e., "not a number") values:

In [47]:
pd.DataFrame([{'aa':1, 'bb':2},{"bb":3, 'cc':6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

#### From a two-dimensional NumPy array

Given a two-dimensional array of data, we can create a ``DataFrame`` with any specified column and index names.
If omitted, an integer index will be used for each:

In [49]:
pd.DataFrame(np.random.randint(2, 12),
            columns=['foo', 'bar'],
            index = ['a','b','c'])

   foo  bar
a    3    3
b    3    3
c    3    3

## The Pandas Index Object

We have seen here that both the ``Series`` and ``DataFrame`` objects contain an explicit *index* that lets you take reference and modify data.
This ``Index`` object is an interesting structure in itself, and it can be thought of either as an *immutable array* or as an *ordered set* (technically a multi-set, as ``Index`` objects may contain repeated values).
Those views have some interesting consequences in the operations available on ``Index`` objects.
As a simple example, let's construct an ``Index`` from a list of integers:

In [51]:
ind = pd.Index([10,20,30,40,50])
ind

Int64Index([10, 20, 30, 40, 50], dtype='int64')

### Index as immutable array

The ``Index`` in many ways operates like an array.
For example, we can use standard Python indexing notation to retrieve values or slices:

In [52]:
ind[1]

20

In [54]:
ind[1:4:2]

Int64Index([20, 40], dtype='int64')

``Index`` objects also have many of the attributes familiar from NumPy arrays:

In [55]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

One difference between ``Index`` objects and NumPy arrays is that indices are immutable–that is, they cannot be modified via normal means:

In [57]:
ind[1]= 0

TypeError: Index does not support mutable operations

This immutability makes it safer to share indices between multiple ``DataFrame``s and arrays, without the potential for side effects from inadvertent index modification.

# Operating on Data in Pandas

One of the essential pieces of NumPy is the ability to perform quick element-wise operations, both with basic arithmetic (addition, subtraction, multiplication, etc.) and with more sophisticated operations (trigonometric functions, exponential and logarithmic functions, etc.).
Pandas inherits much of this functionality from NumPy, and the ufuncs are key to this.

Pandas includes a couple useful twists, however: for unary operations like negation and trigonometric functions, these ufuncs will *preserve index and column labels* in the output, and for binary operations such as addition and multiplication, Pandas will automatically *align indices* when passing the objects to the ufunc.
This means that keeping the context of data and combining data from different sources–both potentially error-prone tasks with raw NumPy arrays–become essentially foolproof with Pandas.
We will additionally see the well-defined operations between one-dimensional ``Series`` structures and two-dimensional ``DataFrame`` structures.

## Ufuncs: Index Preservation

Because Pandas is designed to work with NumPy, any NumPy ufunc will work on Pandas ``Series`` and ``DataFrame`` objects.
Let's start by defining a simple ``Series`` and ``DataFrame`` on which to demonstrate this:

In [65]:
abc = np.random.RandomState(10)
ser = pd.Series(abc.randint(0,10,4))
ser

0    9
1    4
2    0
3    1
dtype: int32

In [71]:
der = pd.DataFrame(abc.randint(0,10,(5,4)),
               columns= ['A', 'B', 'C', 'D'])
der

   A  B  C  D
0  0  6  9  1
1  8  9  1  2
2  8  9  9  5
3  0  2  7  3
4  0  4  2  0

If we apply a NumPy ufunc on either of these objects, the result will be another Pandas object *with the indices preserved:*

In [72]:
np.exp(ser)

0    8103.083928
1      54.598150
2       1.000000
3       2.718282
dtype: float64

Or, for a slightly more complex calculation:

In [73]:
np.sin(der * np.pi / 4)

              A             B         C         D
0  0.000000e+00 -1.000000e+00  0.707107  0.707107
1 -2.449294e-16  7.071068e-01  0.707107  1.000000
2 -2.449294e-16  7.071068e-01  0.707107 -0.707107
3  0.000000e+00  1.000000e+00 -0.707107  0.707107
4  0.000000e+00  1.224647e-16  1.000000  0.000000

## Universal Functions: Index Alignment

For binary operations on two ``Series`` or ``DataFrame`` objects, Pandas will align indices in the process of performing the operation.
This is very convenient when working with incomplete data, as we'll see in some of the examples that follow.

### Index alignment in Series

As an example, suppose we are combining two different data sources, and find only the top three US states by *area* and the top three US states by *population*:

In [76]:
area = pd.Series({'Alaska': 127444, 'Texas':24556, 'california':45699,
                }, name='area')
population = pd.Series({'California':5819946, 'Texas': 789554,
                       'New York': 448775}, name = 'population')
print(area)
population

Alaska        127444
Texas          24556
california     45699
Name: area, dtype: int64

California    5819946
Texas          789554
New York       448775
Name: population, dtype: int64

Let's see what happens when we divide these to compute the population density:

In [77]:
population/area

Alaska              NaN
California          NaN
New York            NaN
Texas         32.153201
california          NaN
dtype: float64

The resulting array contains the *union* of indices of the two input arrays, which could be determined using standard Python set arithmetic on these indices:

In [78]:
area.index | population.index

C:\Users\MANOJ\AppData\Local\Temp\ipykernel_23648\3572280633.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead.
  area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas', 'california'], dtype='object')

In [79]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index = [1, 2, 3])
print(A)
print(B)

0    2
1    4
2    6
dtype: int64
1    1
2    3
3    5
dtype: int64

If using NaN values is not the desired behavior, the fill value can be modified using appropriate object methods in place of the operators.
For example, calling ``A.add(B)`` is equivalent to calling ``A + B``, but allows optional explicit specification of the fill value for any elements in ``A`` or ``B`` that might be missing:

In [80]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

The following table lists Python operators and their equivalent Pandas object methods:

| Python Operator | Pandas Method(s)                      |
|-----------------|---------------------------------------|
| ``+``           | ``add()``                             |
| ``-``           | ``sub()``, ``subtract()``             |
| ``*``           | ``mul()``, ``multiply()``             |
| ``/``           | ``truediv()``, ``div()``, ``divide()``|
| ``//``          | ``floordiv()``                        |
| ``%``           | ``mod()``                             |
| ``**``          | ``pow()``                             |

## Ufuncs: Operations Between DataFrame and Series

When performing operations between a ``DataFrame`` and a ``Series``, the index and column alignment is similarly maintained.
Operations between a ``DataFrame`` and a ``Series`` are similar to operations between two-dimensional and one-dimensional NumPy array.
Consider one common operation, where we find the difference of a two-dimensional array and one of its rows:

# Data wrangling
Getting the data in the shape that we want is the single most time consuming task in the life of the Data Scientist. Sometimes it can be the most frustrating.

## Merge operations
By merging we mean combining different data sets by linking rows with one or more keys. The basic syntax is very simple.

In [120]:
df

   Year  Literacy States     nonsense  Serie_aligned
0  2012       1.2     KA  1676.666667              0
1  2013       1.5     AP  1342.000000              1
2  2014       1.6     TN  1258.750000              2
3  2013       1.1     KL  1830.000000              3
4  2012       2.1     MH   958.095238              4

In [121]:
df2 = pd.DataFrame({'States': ['KA','KL', 'AP'], 'Population':[100000,200000,300000]})
df2

  States  Population
0     KA      100000
1     KL      200000
2     AP      300000

Let's say we want a dataset with year, literacy, province and population. We can create it from `df` and `df2`.

In [122]:
  # merge is smart! If there are overlapping names, it uses those for the merge
df.merge(df2)

   Year  Literacy States     nonsense  Serie_aligned  Population
0  2012       1.2     KA  1676.666667              0      100000
1  2013       1.5     AP  1342.000000              1      300000
2  2013       1.1     KL  1830.000000              3      200000

If the column names are different, you need to specify them explicitely

In [128]:
df3 = pd.DataFrame({"States": ["KA","KL"], "Population": [100000,200000]})
df3
df.merge(df3, right_on='States', left_on='States')

   Year  Literacy States     nonsense  Serie_aligned  Population
0  2012       1.2     KA  1676.666667              0      100000
1  2013       1.1     KL  1830.000000              3      200000

What happened? Zuid Holland is weg!

By default `merge` does inner joins. If you want a different type of join, you can specify it.

In [129]:
df4 = pd.DataFrame({"States":["KA","AP","MP"], "Population": [100000,200000,300000]})
df.merge(df4, how='outer')

     Year  Literacy States     nonsense  Serie_aligned  Population
0  2012.0       1.2     KA  1676.666667            0.0    100000.0
1  2013.0       1.5     AP  1342.000000            1.0    200000.0
2  2014.0       1.6     TN  1258.750000            2.0         NaN
3  2013.0       1.1     KL  1830.000000            3.0         NaN
4  2012.0       2.1     MH   958.095238            4.0         NaN
5     NaN       NaN     MP          NaN            NaN    300000.0

Check this out:

In [131]:
df5 = pd.DataFrame({"States":["KA","AP","KA"], "Population": [100000,200000,300000]})
print(df)
df.merge(df5, how='outer')

   Year  Literacy States     nonsense  Serie_aligned
0  2012       1.2     KA  1676.666667              0
1  2013       1.5     AP  1342.000000              1
2  2014       1.6     TN  1258.750000              2
3  2013       1.1     KL  1830.000000              3
4  2012       2.1     MH   958.095238              4

   Year  Literacy States     nonsense  Serie_aligned  Population
0  2012       1.2     KA  1676.666667              0    100000.0
1  2012       1.2     KA  1676.666667              0    300000.0
2  2013       1.5     AP  1342.000000              1    200000.0
3  2014       1.6     TN  1258.750000              2         NaN
4  2013       1.1     KL  1830.000000              3         NaN
5  2012       2.1     MH   958.095238              4         NaN

This was a many-to-many merge. Even though if you think about it, the behavior is what you expect, you might still not think about it and be surprised!

### Combining data with overlap
Sometimes some data is missing, and it can be "patched" with another dataset. Let's take a look.

In [133]:
serie_a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
                   index = ['f','e','d','c','b','a'])
serie_b = pd.Series(np.arange(len(serie_a), dtype=np.float64),
                   index = ['f','e','d','c','b','a'])

In [134]:
serie_a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [135]:
serie_b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

Let's say we want to update `a` with the values from `b`. The num-pythonic way to do that is

In [136]:
pd.Series(np.where(pd.isnull(serie_a), serie_b, serie_a),index=serie_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

That's a bit verbose for something so simple. What about this:

In [137]:
serie_a.combine_first(serie_b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64